{
  "projects": [
    {
      "id": 1,
      "title": "Build a Clone of a Website",
      "details": "Building a website clone is an excellent method to learn the fundamentals of page structure, colors, fonts, media, tables, and other design elements. To duplicate the original, go into as much detail as possible. Choose a website that you enjoy and create a clone of it. To get the most out of the source code, avoid looking at it as much as possible. The benefit of cloning a website is that you may choose the level of complexity. A simple website that simply requires HTML and CSS is a wonderful place to start if you’re just getting started. Choose a website that uses JavaScript or React if you’re more advanced.",
      "SkillsRequired": [
        "HTML",
        "CSS",
        "JavaScript"
      ],
      "complete": true
    },
    {
      "id": 2,
      "title": "Build your own Portfolio Site",
      "details": "Building a personal portfolio website is one of the most simple yet tough front-end project ideas. You might begin by using your website as a resume. This means you can add information to the website about your experience, talents, and expertise. For this reason, many freelance web designers and developers have lovely personal portfolio websites. To maintain the website entertaining, original, and interactive, you’ll need to apply your HTML, CSS, and JavaScript skills. You should be able to organize a webpage with HTML, style its elements with CSS, and make the website interactive with JS. Also, to upgrade your HTML skills you can enroll in Geeksforgeeks Advanced HTML – Self-Paced course and give your career a hike in web development.",
      "SkillsRequired": [
        "HTML",
        "CSS",
        "JavaScript"
      ],
      "complete": true
    },
    {
      "id": 3,
      "title": "A CRUD Operation Web App",
      "details": "As a front-end developer, you’ll need to be familiar with CRUD (Create-Read-Update-Delete) operations because they’re a common feature for most websites (including blogs, e-commerce, dashboards, and so on). A To-Do List or a Notes webpage are two examples of CRUD applications. Having one of these projects on your website demonstrates your knowledge of data structures. It’s also an excellent chance to show off your frontend framework skills. Recommended technology: Because CRUD apps require the usage of reusable components, it’s a good idea to develop them with a framework like React or Vue, depending on your level of experience.",
      "SkillsRequired": [
        "JavaScript",
        "React",
        "Vue"
      ],
      "complete": true
    },
    {
      "id": 4,
      "title": "A Dynamic Landing Page",
      "details": "Once you’ve learned the essentials of front-end development, such as HTML, CSS, and JavaScript, you may go to the next level by exploring Bootstrap’s capabilities. It streamlines your job and boosts your output. With this information, you can use Bootstrap to develop a highly engaging landing page for any product. You may make it more interesting by displaying the user’s time and name from local storage. You may use Bootstrap to reproduce some of your favorite landing sites. You can also start off your journey in the field of  Website Development & create exciting projects with Geeksforgeeks CSS Foundation – Self-Paced course and enhance your logical & analytical acumen. ",
      "SkillsRequired": [
        "HTML",
        "CSS",
        "JavaScript",
        "Bootstrap"
      ],
      "complete": false
    },
    {
      "id": 5,
      "title": "Build a Weather App",
      "details": "A weather application can be created with HTML, CSS, and JavaScript. You may use the Open Weather Map API to add weather information. In this project, you may also use AngularJS. To make your website look nice, you can use design-oriented libraries. The Open Weather Map API will provide you with the essential weather information for various locations, and it will be your job to present that information in a pleasant manner. After completing this project, you’ll be familiar with various JS, Angular, and AJAX components. Also, you can use the two building blocks HTML and CSS, by going through Top 10 Projects For Beginners To Practice HTML and CSS Skills and create some amazing applications. ",
      "SkillsRequired": [
        "HTML",
        "CSS",
        "JavaScript"
      ],
      "complete": true
    },
    {
      "id": 6,
      "title": "Build a JavaScript Quiz",
      "details": "When you first start learning JavaScript, figuring out how to put what you’ve learned into practice and choosing a project that fits within your skillset might be difficult. Building a little quiz game is a great place to start. You’ll have to deal with highly abstract logic, and it’ll be up to you to control and/or expand the range of quiz difficulty. Begin by creating a simple game with four multiple-choice questions. While making these questions up, assign correct answers to each of them. You’ll learn a lot about data management and creating a scoring system while programming.",
      "SkillsRequired": [
        "HTML",
        "CSS",
        "JavaScript"
      ],
      "complete": false
    }
  ]
}